# Series

In [1]:
import numpy as np
import pandas as pd

## Create a series

### From List

In [4]:
keys = ['a','b','c']
values = [1,2,3]

In [8]:
my_series_list = pd.Series(values)
type(my_series_list)

pandas.core.series.Series

In [10]:
my_series_list

0    1
1    2
2    3
dtype: int64

In [12]:
my_series_list = pd.Series(values,keys)
type(my_series_list)

pandas.core.series.Series

In [14]:
my_series_list

a    1
b    2
c    3
dtype: int64

### Retrieve value from series

In [16]:
my_series_list = ['a']

1

### From Array

In [26]:
arr = np.array([1,2,3])

In [27]:
arr

array([1, 2, 3])

In [28]:
my_series_arr = pd.Series(arr,keys)

In [29]:
my_series_arr['b']

2

### From Dictionary

In [30]:
my_dict ={'a':5,'b':10,'c':15}

In [32]:
my_dict

{'a': 5, 'b': 10, 'c': 15}

In [33]:
my_series_dict = pd.Series(my_dict)

In [34]:
my_series_dict

a     5
b    10
c    15
dtype: int64

In [35]:
my_series_dict['c']

15

# Dataframe

In [80]:
data = [['John',90,95,85],['Paul',90,88,92],['Ringo',80,75,90],['George',95,95,95]]
df = pd.DataFrame(data,columns=['name','english','maths','science'],index='1 2 3 4'.split())
print(df)

     name  english  maths  science
1    John       90     95       85
2    Paul       90     88       92
3   Ringo       80     75       90
4  George       95     95       95

In [81]:
df['name']

1      John
2      Paul
3     Ringo
4    George
Name: name, dtype: object

In [82]:
df['name'][2]

'Ringo'

In [83]:
df[['name','maths']]

     name  maths
1    John     95
2    Paul     88
3   Ringo     75
4  George     95

In [84]:
df['total_marks'] = df['english'] + df['maths'] + df['science']

In [85]:
df

     name  english  maths  science  total_marks
1    John       90     95       85          270
2    Paul       90     88       92          270
3   Ringo       80     75       90          245
4  George       95     95       95          285

In [86]:
df.drop('total_marks',axis=1)

     name  english  maths  science
1    John       90     95       85
2    Paul       90     88       92
3   Ringo       80     75       90
4  George       95     95       95

In [87]:
df

     name  english  maths  science  total_marks
1    John       90     95       85          270
2    Paul       90     88       92          270
3   Ringo       80     75       90          245
4  George       95     95       95          285

In [88]:
df.drop('total_marks',axis=1,inplace=True)

In [89]:
df

     name  english  maths  science
1    John       90     95       85
2    Paul       90     88       92
3   Ringo       80     75       90
4  George       95     95       95

### Selecting a row

In [91]:
df.loc['1']

name       John
english      90
maths        95
science      85
Name: 1, dtype: object

In [92]:
df.iloc[2]

name       Ringo
english       80
maths         75
science       90
Name: 3, dtype: object

### Conditional Selection

In [98]:
df[(df['english'] > 75) & (df['maths'] > 90)]

     name  english  maths  science
1    John       90     95       85
4  George       95     95       95